In [20]:
import pandas as pd

In [21]:
# Creating a data frame using python dictionary
weather_data = {
    'day' :['1/8/2019','31/7/2019'],
    'temperature':[32,35],
    'windspeed':[6,7],
    'event':['Rain','Sunny']
}
df_csv = pd.DataFrame(weather_data)

In [22]:
df_csv

         day  temperature  windspeed  event
0   1/8/2019           32          6   Rain
1  31/7/2019           35          7  Sunny

In [23]:
# Creating a data frame by importing excel file
#df_excel = pd.read_excel("name of excel file","name of the sheet")

In [24]:
# Creating a data frame by importing csv
#df_csv = pd.read_csv("name of csv")

In [25]:
# Creating a data frame by using a list of tuples and specifying column names
weather_data_tuples=[
    ('1/8/2019',32,6,'Rain'),
    ('31/7/2019',35,8,'Sunny'),
    ('30/7/2019',28,2,'Snow')
]
df = pd.DataFrame(weather_data_tuples,columns=['day','temperature','windspeed','event'])

In [26]:
df

         day  temperature  windspeed  event
0   1/8/2019           32          6   Rain
1  31/7/2019           35          8  Sunny
2  30/7/2019           28          2   Snow

In [27]:
# Creating a data frame using a list of dictionaries
weather_data_list_of_dicts = [
    {'day':'1/8/2019','temperature':32,'windspeed':6,'event':'Rain'},
    {'day':'31/7/2019','temperature':35,'windspeed':8,'event':'Sunny'},
    {'day':'30/7/2019','temperature':28,'windspeed':2,'event':'Snow'}
]
df_list_of_dicts = pd.DataFrame(weather_data_list_of_dicts)

In [28]:
df_list_of_dicts

         day  event  temperature  windspeed
0   1/8/2019   Rain           32          6
1  31/7/2019  Sunny           35          8
2  30/7/2019   Snow           28          2

In [29]:
# google panda io to find more ways of creating loading and writing dataframes

# comprehensive guide of reading in CSV

In [30]:
#value passed to skiprows 是指csv中的第几行（从1开始）
#value passed to header 是指用第几行作为header（从0开始）header的default是被skip后的第一行（从1开始）
df = pd.read_csv('stock_data.csv',skiprows=1)
df

  tickers            eps  revenue price         people
0    GOOL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not availabel       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [31]:
# use nrows to specify the number of rows that you want to include
df = pd.read_csv('stock_data.csv',nrows=3,skiprows=1)
df

  tickers    eps  revenue  price      people
0    GOOL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [32]:
# use pass all the values that represent NA to na_values
df = pd.read_csv('stock_data.csv',na_values=['n.a.','not availabel'],skiprows=1)
df

  tickers    eps  revenue   price         people
0    GOOL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3     RIL    NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [33]:
# you can also pass a dictionary to na_values to specify in which column which value should be treated as NA
df = pd.read_csv('stock_data.csv',na_values={
    'eps':['n.a.','not availabel'],
    'revenue':['n.a.','not availabel',-1],
    'price':['n.a.','not availabel'],
    'people':['n.a.','not availabel']
},skiprows=1)
df

  tickers    eps  revenue   price         people
0    GOOL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [34]:
# you can output your dataframe as a csv while specifying if you want header or index
df.to_csv('new.csv',index=False,header=False)

In [35]:
df

  tickers    eps  revenue   price         people
0    GOOL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [36]:
# this gives the first three rows in df
df.iloc[:3]

  tickers    eps  revenue  price      people
0    GOOL  27.82     87.0  845.0  larry page
1     WMT   4.61    484.0   65.0         NaN
2    MSFT  -1.00     85.0   64.0  bill gates

In [38]:
#this gives you the value at the second column of the first row
df.iloc[0,1]

27.82

In [39]:
#this gives you all the rows that has 'GOOL' as the value of their tickers column
df.loc[df['tickers']=='GOOL']

  tickers    eps  revenue  price      people
0    GOOL  27.82     87.0  845.0  larry page

In [40]:
# this sorts the rows by the column and order that you specify
df.sort_values('tickers',ascending=False)

# you can also do

  tickers    eps  revenue   price         people
1     WMT   4.61    484.0    65.0            NaN
4    TATA   5.60      NaN     NaN     ratan tata
3     RIL    NaN     50.0  1023.0  mukesh ambani
2    MSFT  -1.00     85.0    64.0     bill gates
0    GOOL  27.82     87.0   845.0     larry page